<?php

/*
 * Проверка константы в целях безопасности
 */
if (!defined('ThisScript')) {
    header("Location: /");
    exit();
}

$config['driver'] = "mysql"; //драйвер базы данных
$config['host'] = "localhost"; //хост
$config['database'] = "database"; //имя базы данных
$config['username'] = "root"; //лоин для подключения к БД
$config['password'] = "password"; //пароль для подключения к БД
$prefixdb = "nja_";

$SiteName="НЯ!";

$GameClass = array("Воин", "Маг", "Лучник", "Жрец", "Оборотень",
    "Друид", "Убийца", "Шаман", "Страж", "Мистик");

$Sklad_resource = array("yan8" => "Янтарь 8",
    "yan9" => "Янтарь 9",
    "yan10" => "Янтарь 10",
    "yan11" => "Янтарь 11",
    "yan12" => "Янтарь 12",
    "rub8" => "Рубин 8",
    "rub9" => "Рубин 9",
    "rub10" => "Рубин 10",
    "rub11" => "Рубин 11",
    "rub12" => "Рубин 12",
    "sap8" => "Сапфир 8",
    "sap9" => "Сапфир 9",
    "sap10" => "Сапфир 10",
    "sap11" => "Сапфир 11",
    "sap12" => "Сапфир 12",
    "top8" => "Топаз 8",
    "top9" => "Топаз 9",
    "top10" => "Топаз 10",
    "top11" => "Топаз 11",
    "top12" => "Топаз 12",
    "iz8" => "Изумруд 8",
    "iz9" => "Изумруд 9",
    "iz10" => "Изумруд 10",
    "iz11" => "Изумруд 11",
    "iz12" => "Изумруд 12",
    "yash8" => "Яшма 8",
    "yash9" => "Яшма 9",
    "yash10" => "Яшма 10",
    "yash11" => "Яшма 11",
    "yash12" => "Яшма 12",
    "book" => "Книга времени",
    "pvo" => "ПВО",
    "nis" => "Награда ИС",
    "emblema" => "Эмблема бесстрашия");

$TableName = array("mirpit" => "Мирпиты", "gtz" => "ГТЗ", "gvg" => "ГВГ",
    "pvp" => "ПВП", "remeslo" => "Ремесло", "help" => "Помощ",
    "nalog" => "Налог", "shtraf" => "Штрафы", "oficer" => "Должность",
    "sklad" => "Склад", "dcd" => "ДЦД");
?>
